In [2]:
#14 May 2025
#CSV and Pandas (library)
#CSV is important, therefore Ayush sir has shared the presentation

In [3]:
pwd

'C:\\Users\\anil.rai\\python'

In [4]:
#for data science we need all of pandas
#it needs to be installed for VS Code but not for Jupyter. 
#for jupyter if anacondas installed, everything is there including pandas

In [11]:
!pip install pandas 
%pip install pandas #for VS Code

Requirement already satisfied: pandas in c:\users\anil.rai\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\anil.rai\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\anil.rai\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\anil.rai\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\anil.rai\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\anil.rai\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip
ERROR: Invalid requirement: '#for': Expected package name at the start of dependency specifier
    #for
    ^

In [13]:
import pandas as pd
df = pd.read_csv('data.csv')
df #dataframe which is also mutable though it is regarded as immutable, but there are conditions when it changes

    name  age        add       phone
0    Ram   34  Kathmandu  9846023456
1   Sita   22   Lalitpur  9823456789
2   Hari   25   Sindhuli   985478923
3  Gopal   29      Kavre  9834679090
4   Gita   34    Sunsari  9856783424
5  Naran   31      Jhapa  9856783234

In [15]:
df = pd.read_csv('data.csv',nrows=5)
df

    name  age        add       phone
0    Ram   34  Kathmandu  9846023456
1   Sita   22   Lalitpur  9823456789
2   Hari   25   Sindhuli   985478923
3  Gopal   29      Kavre  9834679090
4   Gita   34    Sunsari  9856783424

In [17]:
df = pd.read_csv('data.csv')
df.head(3) #read three rows from top (sampling from population)

   name  age        add       phone
0   Ram   34  Kathmandu  9846023456
1  Sita   22   Lalitpur  9823456789
2  Hari   25   Sindhuli   985478923

In [18]:
df.tail(3) #read three rows from bottom (sampling from population)

    name  age      add       phone
3  Gopal   29    Kavre  9834679090
4   Gita   34  Sunsari  9856783424
5  Naran   31    Jhapa  9856783234

In [20]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\anil.rai\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\anil.rai\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\anil.rai\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\anil.rai\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\anil.rai\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\anil.rai\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [21]:
df #whole population

    name  age        add       phone
0    Ram   34  Kathmandu  9846023456
1   Sita   22   Lalitpur  9823456789
2   Hari   25   Sindhuli   985478923
3  Gopal   29      Kavre  9834679090
4   Gita   34    Sunsari  9856783424
5  Naran   31      Jhapa  9856783234

In [22]:
df.shape #rows and column

(6, 4)

In [24]:
row,col = df.shape
print(row)
print(col)

6
4

In [ ]:
#two ways to select column
#1. usecols
#2. df[[]]

In [25]:
df = pd.read_csv('data.csv', usecols = ['name','phone'] ) #usecols -> how many columns to be used
df

    name       phone
0    Ram  9846023456
1   Sita  9823456789
2   Hari   985478923
3  Gopal  9834679090
4   Gita  9856783424
5  Naran  9856783234

In [29]:
df = pd.read_csv('data.csv')
df [['name','phone']] #this syntax -> is it because of 2D data? Ayush sir said, it's not as Pandas doesn't

    name       phone
0    Ram  9846023456
1   Sita  9823456789
2   Hari   985478923
3  Gopal  9834679090
4   Gita  9856783424
5  Naran  9856783234

In [30]:
df = pd.read_csv('data.csv')
df ['name'] #just for selecting one column

0      Ram
1     Sita
2     Hari
3    Gopal
4     Gita
5    Naran
Name: name, dtype: object

In [31]:
#iloc #index localizer (both rows and columns have their index)

In [32]:
df = pd.read_csv('data.csv')
df

    name  age        add       phone
0    Ram   34  Kathmandu  9846023456
1   Sita   22   Lalitpur  9823456789
2   Hari   25   Sindhuli   985478923
3  Gopal   29      Kavre  9834679090
4   Gita   34    Sunsari  9856783424
5  Naran   31      Jhapa  9856783234

In [35]:
df = pd.read_csv('data.csv')
df.iloc[1:4] #selecting rows from anywhere -> top, bottom or middle section

    name  age       add       phone
1   Sita   22  Lalitpur  9823456789
2   Hari   25  Sindhuli   985478923
3  Gopal   29     Kavre  9834679090

In [36]:
df = pd.read_csv('data.csv')
df.iloc[1:4,0:3] #select rows and column index-wise and sequentially

    name  age       add
1   Sita   22  Lalitpur
2   Hari   25  Sindhuli
3  Gopal   29     Kavre

In [37]:
#condition

df['add'] #this is series

0    Kathmandu
1     Lalitpur
2     Sindhuli
3        Kavre
4      Sunsari
5        Jhapa
Name: add, dtype: object

In [38]:
#condition

df['add'] == 'Kathmandu' #using comparision operator

0     True
1    False
2    False
3    False
4    False
5    False
Name: add, dtype: bool

In [39]:
df[df['add'] == 'Kathmandu']

  name  age        add       phone
0  Ram   34  Kathmandu  9846023456

In [40]:
df

    name  age        add       phone
0    Ram   34  Kathmandu  9846023456
1   Sita   22   Lalitpur  9823456789
2   Hari   25   Sindhuli   985478923
3  Gopal   29      Kavre  9834679090
4   Gita   34    Sunsari  9856783424
5  Naran   31      Jhapa  9856783234

In [44]:
#multiple condition OR operator '|' pipe sign

df[(df['add'] == 'Kathmandu') | (df['age']>30)]

    name  age        add       phone
0    Ram   34  Kathmandu  9846023456
4   Gita   34    Sunsari  9856783424
5  Naran   31      Jhapa  9856783234

In [45]:
#AND with '&' amphersand sign
df[(df['add'] == 'Kathmandu') & (df['age']>30)]

  name  age        add       phone
0  Ram   34  Kathmandu  9846023456

In [3]:
import pandas as pd
df = pd.read_csv('data.csv')
df

    name  age        add       phone
0    Ram   34  Kathmandu  9846023456
1   Sita   22   Lalitpur  9823456789
2   Hari   25   Sindhuli   985478923
3  Gopal   29      Kavre  9834679090
4   Gita   34    Sunsari  9856783424
5  Naran   31      Jhapa  9856783234

In [7]:
#save to csv file from the filtered data
df = df[df['add'] == 'Kathmandu']
df.to_csv('filter_data.csv')

In [6]:
df.to_json('filter_data.json') #json is dictionary type, used in django/API, json is light compared to csv

In [15]:
#to read json
import pandas as pd
df = pd.read_json('filter_data.json')
df

  name  age        add       phone
0  Ram   34  Kathmandu  9846023456

In [11]:
#If we have list inside list instead of dataframe, how do we save to csv
#first method using csv package
#used mostly by django developer
import csv #csv package is light compared to pandas
data = [['name','age','add'],
       ['Ram',34,'Kathmandu'],
       ['Shyam',45,'Bhaktapur'],
       ['Hari',40,'Lalitpur']]

file = open('list_data.csv','w') #file creation, file is an object, we don't call it variable
x = csv.writer(file) #x is an object that holds the operation, variable is which holds value
x.writerows(data)
file.close()

In [12]:
df = pd.read_csv('list_data.csv')
df

    name  age        add
0    Ram   34  Kathmandu
1  Shyam   45  Bhaktapur
2   Hari   40   Lalitpur

In [18]:
#second method is using pandas package of saving list inside list into a csv file
#pandas is heavy package compared to csv
#for data science, pandas is used 
import pandas as pd
data = [['Ram',34,'Kathmandu'],
       ['Shyam',45,'Bhaktapur'],
       ['Hari',40,'Lalitpur']]
df = pd.DataFrame(data, columns = ['name', 'age', 'add']) #convert to dataframe
df.to_csv('list_data.csv') #can be shared in excel file format as well
df

    name  age        add
0    Ram   34  Kathmandu
1  Shyam   45  Bhaktapur
2   Hari   40   Lalitpur

In [19]:
#file is in dictionary format, how do we save in csv
#list inside dictionary to csv file
data = {
    'name': ['Ram', 'Shyam','Hari'],
    'age': [34,56,33],
    'address':['Kathmandu','Bhaktapur','Lalitpur']
}

df = pd.DataFrame(data) #first convert to dataframe
df.to_csv('list_data.csv')
df

    name  age    address
0    Ram   34  Kathmandu
1  Shyam   56  Bhaktapur
2   Hari   33   Lalitpur

In [20]:
data = {
    'sn':[1,2,3],
    'name': ['Ram', 'Shyam','Hari'],
    'age': [34,56,33],
    'address':['Kathmandu','Bhaktapur','Lalitpur']
}

df = pd.DataFrame(data) #first convert to dataframe
df.to_csv('list_data.csv')
df

   sn   name  age    address
0   1    Ram   34  Kathmandu
1   2  Shyam   56  Bhaktapur
2   3   Hari   33   Lalitpur

In [23]:
df = pd.read_csv('list_data.csv',index_col = 'sn')
df

    Unnamed: 0   name  age    address
sn
1            0    Ram   34  Kathmandu
2            1  Shyam   56  Bhaktapur
3            2   Hari   33   Lalitpur

In [43]:
#removing or dropping column 'Unnamed'
#unmutable 
df = pd.read_csv('list_data.csv',index_col='sn')
df.drop('Unnamed: 0', axis = 1) #axis 1 -> column, axis 0-> row

     name  age    address
sn
1     Ram   34  Kathmandu
2   Shyam   56  Bhaktapur
3    Hari   33   Lalitpur

In [46]:
#removing or dropping column 'Unnamed'
#mutable way, changing the original values
#one method
df = pd.read_csv('list_data.csv',index_col='sn')
df = df.drop('Unnamed: 0', axis = 1) #axis 1 -> column, axis 0-> row
df

     name  age    address
sn
1     Ram   34  Kathmandu
2   Shyam   56  Bhaktapur
3    Hari   33   Lalitpur

In [47]:
#removing or dropping column 'Unnamed'
#mutable way
#second method
df = pd.read_csv('list_data.csv',index_col='sn')
df.drop('Unnamed: 0', axis = 1, inplace = True) #axis 1 -> column, axis 0-> row
df

     name  age    address
sn
1     Ram   34  Kathmandu
2   Shyam   56  Bhaktapur
3    Hari   33   Lalitpur

In [40]:
df = pd.read_csv('list_data.csv',index_col = 'sn')
df.drop([1,3], axis = 0) #removing rows

    Unnamed: 0   name  age    address
sn
2            1  Shyam   56  Bhaktapur

In [25]:
#dictionary reader
#csv to dictionary format

import csv
with open('data.csv') as csvfile:
    reader = csv.DictReader(csvfile) #'reader' is an object here
    for row in reader:
        print(row)

{'name': 'Ram', 'age': '34', 'add': 'Kathmandu', 'phone': '9846023456'}
{'name': 'Sita', 'age': '22', 'add': 'Lalitpur', 'phone': '9823456789'}
{'name': 'Hari', 'age': '25', 'add': 'Sindhuli', 'phone': '985478923'}
{'name': 'Gopal', 'age': '29', 'add': 'Kavre', 'phone': '9834679090'}
{'name': 'Gita', 'age': '34', 'add': 'Sunsari', 'phone': '9856783424'}
{'name': 'Naran', 'age': '31', 'add': 'Jhapa', 'phone': '9856783234'}

In [26]:
#list inside dictionary
#API -> API is needed in web application (front end), mobile app needs data to be presented in json format (dictionary, list)
import csv
with open('data.csv') as csvfile:
    reader = csv.DictReader(csvfile) #reader is an object
    print([i for i in reader]) #list as comprehension, instead of for loop -> for loop is used less professionally

[{'name': 'Ram', 'age': '34', 'add': 'Kathmandu', 'phone': '9846023456'}, {'name': 'Sita', 'age': '22', 'add': 'Lalitpur', 'phone': '9823456789'}, {'name': 'Hari', 'age': '25', 'add': 'Sindhuli', 'phone': '985478923'}, {'name': 'Gopal', 'age': '29', 'add': 'Kavre', 'phone': '9834679090'}, {'name': 'Gita', 'age': '34', 'add': 'Sunsari', 'phone': '9856783424'}, {'name': 'Naran', 'age': '31', 'add': 'Jhapa', 'phone': '9856783234'}]

In [30]:
#second method
import csv
csvfile = open('data.csv','r') #we can just write csvfile = open('data.csv') as the default mode is 'read' no need to write 'r'
reader = csv.DictReader(csvfile)
print([i for i in reader])

[{'name': 'Ram', 'age': '34', 'add': 'Kathmandu', 'phone': '9846023456'}, {'name': 'Sita', 'age': '22', 'add': 'Lalitpur', 'phone': '9823456789'}, {'name': 'Hari', 'age': '25', 'add': 'Sindhuli', 'phone': '985478923'}, {'name': 'Gopal', 'age': '29', 'add': 'Kavre', 'phone': '9834679090'}, {'name': 'Gita', 'age': '34', 'add': 'Sunsari', 'phone': '9856783424'}, {'name': 'Naran', 'age': '31', 'add': 'Jhapa', 'phone': '9856783234'}]